# List of Visual Studio Code extensions to install.
# Blank lines and lines that start with '#' will be ignored.
#
# Run ./scripts/install-vscode.sh to install these, and to copy
# preferences out of vscode/prefs into your VCode folder.

# Color theme
azemoh.one-monokai

# Must-have git plugin
eamodio.gitlens

# Good plugin for tracking "TODO"s and "FIXME"s.
Gruntfuggly.todo-tree

# Javascript/HTML plugins
christian-kohler.npm-intellisense
dbaeumer.vscode-eslint
eg2.vscode-npm-script
esbenp.prettier-vscode
jpoissonnier.vscode-styled-components
wix.vscode-import-cost
jacobcofman.changelog
syler.sass-indented
# This will auto-run jest tests in the background, and make it easy to
# debug individual tests.
orta.vscode-jest
# Mocha test runner.  To use this with a typescript project, need to add something like:
#    "mochaExplorer.files": "test/**/*.test.ts",
#    "mochaExplorer.require": "ts-node/register"
# to your .vscode/settings.json.
hbenl.vscode-mocha-test-adapter
spoonscen.es6-mocha-snippets


# Python
ms-python.python
ms-vscode-remote.remote-containers

# Rust
rust-lang.rust
bungcip.better-toml

# Golang
golang.go

# Lots of people like this spell checker.
streetsidesoftware.code-spell-checker

# Find "hidden" characters, like non-breaking spaces
nhoizey.gremlins

# Misc other plugins
naumovs.color-highlight
DavidAnson.vscode-markdownlint
GitHub.vscode-pull-request-github
GrapeCity.gc-excelviewer
mechatroner.rainbow-csv
ms-azuretools.vscode-docker
redhat.vscode-yaml
VisualStudioExptTeam.vscodeintellicode
mads-hartmann.bash-ide-vscode

# Use `"editor.bracketPairColorization.enabled": true` instead of this - much faster.
# CoenraadS.bracket-pair-colorizer-2
