# List of Visual Studio Code extensions to install.
# Blank lines and lines that start with '#' will be ignored.

azemoh.one-monokai
christian-kohler.npm-intellisense
CoenraadS.bracket-pair-colorizer-2
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
eamodio.gitlens
eg2.vscode-npm-script
esbenp.prettier-vscode
GrapeCity.gc-excelviewer
Gruntfuggly.todo-tree
jacobcofman.changelog
jpoissonnier.vscode-styled-components
# maty.vscode-mocha-sidebar
mechatroner.rainbow-csv
ms-azuretools.vscode-docker
ms-python.python
ms-vscode-remote.remote-containers
naumovs.color-highlight
redhat.vscode-yaml
spoonscen.es6-mocha-snippets
streetsidesoftware.code-spell-checker
VisualStudioExptTeam.vscodeintellicode
wix.vscode-import-cost
